package edu.crackInterview;

public class chap8_5 {
	//5.1给定两个32位整数N和M，以及表示比特位置的i和j，将M插入N，使得M从N的第j位开始，到第i位结束，假定从
	//j位到i位足以容纳M
	//5.2给定一个介于0和1之间的实数，类型为double，打印其二进制表示，如果该数字无法用32位的二进制表示
	//则打印ERROR
	//5.3给定一个整数，找出与其二进制表示中的1的个数相同，且大小最接近的那两个数（一个略大，一个略小）
	//5.4解释代码((n & (n - 1)) == 0)的具体含义
	//5.5确定需要改变多少位，才能将整数a转换为整数b
	//比如 31 ，14 则为2
	//5.6交换某个整数的奇数位和偶数位，使用指令越少越好（即位0与为1交换，位2与位3交换）
	//5.7数组A包含0到n的所有整数，但其中缺了一个，在这个问题中，只用一次操作无法取得数组A里某个整数的完整内容。此外，
	//数组A的元素皆以二进制表示，唯一可用的访问操作是从A[i]取出第j位操作，给操作的时间复杂度为常数。找出缺失的整数，在O(n)
	//5.8有个单色屏幕存储在一个意味字节数组中，使得8个连续像素可以存放在一个字节里。屏幕宽度为w，
	//且w可以被8整除（即一个字节不会分布在两行上），屏幕高度可以由数组长度及屏幕宽度推算而出。
	//实现drwa(byte[] screen , int width， int x1 , int x2 , int y)，绘制从（x1 ， y）到（x2 ， y）的水平线
}
