package edu.crackInterview;

public class chap8_10 {
	//10.1假如你正在搭建某种业务，有多达1000个客户端软件会调用该服务，取得每天盘后的
	//股票价格信息（开盘、收盘、最高、最低）。假设你手里有这些数据，
	//存储格式可以自行定义。那么你如何定义这套面向客户端的服务，向客户端软件提供信息？
	//10.2如何设计诸如FacebookheLinkedIn的超大型社交网站？请设计一种算法，
	//展示两个人之间的连接关系或者社交路径
	//10.3给定一个文件， 包含40亿个非负整数，设计算法，产生一个不在该文件的中的整数
	//假设你有1GB的内存来完成这项任务
	//进阶，如果只有10Mb内存可用呢？假定所有值都是唯一的
	//10.4给定一个数组，包含1-N的整数，N最大为32000，数组可能含有重复的值，
	//且N的取值不定。若只有4kb内存可用，该如何打印数组中所有重复的元素？
	//10.5设计一个网络爬虫程序，如何避免陷入无限循环？
	//10.6给定100亿个网址，如何检测出重复的文件？这里的重复指的是两个URL完全相同
	//10.7有个web服务器，实现简化版的搜索引擎。有100台机器来响应搜索查询，
	//可能会对另外的机器集群调用processSearch(String qurey)以得到真正的结果。
	//响应查询请求的机器是随机挑选的，因此两个同样地请求不一定由同一台机器响应。
	//方法processSearch开销很大，请设计一种缓存机制，缓存最近几次的查询结果，
	//当数据发生变化时，务必说明如何更新缓存
}
