package edu.crackInterview;

public class chap8_14 {
	/*
	 * 14.1从继承角度看，将构造函数声明为私有有什么作用？
	 * 14.2若在try-catch-finally的try语句中插入return语句，finally是否还会执行？
	 * 14.3final，finally，finalize之间有何差异？
	 * 14.4c++模板和java泛型有什么不同？
	 * c++可以使用节本类型，但是java只能使用类类型
	 * c++中类型参数可以实例化，但是java不可以
	 * java中类型参数不可用于静态方法或变量，但是c++可以
	 * 在java中不管类型参数是什么，泛型类的所有实例都是同一类型，
	 * 类型参数会在运行时被抹去。但是在c++中，参数类型不同，实例类型亦不同
	 * 14.5java中的对象反射是什么？作用？
	 * 获取java类和对象的反射信息的方法，可以：
	 * 运行时取得类的方法和字段的相关信息
	 * 创建某个类的新实例
	 * 通过取得字段引用直接获取和设置对象字段，不管访问修饰符为何
	 * 14.6实现circularArray类，支持类似数组的数据结构，这些数据结构可以高效地
	 * 进行旋转操作，该类使用泛型，
	 * 并通过标准的for(object o:circularArray)语法支持迭代操作
	 */

}
